/***************************************************************************
 *             __________               __   ___.
 *   Open      \______   \ ____   ____ |  | _\_ |__   _______  ___
 *   Source     |       _//  _ \_/ ___\|  |/ /| __ \ /  _ \  \/  /
 *   Jukebox    |    |   (  <_> )  \___|    < | \_\ (  <_> > <  <
 *   Firmware   |____|_  /\____/ \___  >__|_ \|___  /\____/__/\_ \
 *                     \/            \/     \/    \/            \/
 * $Id$
 *
 * Copyright (C) 2002 by Linus Nielsen Feltzing
 * Copyright (C) 2014 by Michael Sevakis
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This software is distributed on an "AS IS" basis, WITHOUT WARRANTY OF ANY
 * KIND, either express or implied.
 *
 ****************************************************************************/
#define __FILESYS_STRUCTS_DRV
#include "config.h"
#include "system.h"
#include "sys/types.h"
#include <errno.h>
#include <string.h>
#include <ctype.h>
#include <stdlib.h>
#include <stdio.h>
#include "fs_attr.h"
#include "pathfuncs.h"
#include "file_internal.h"
#include "dir.h"
#include "storage.h"
#include "timefuncs.h"
#include "rbunicode.h"
#include "debug.h"
#include "panic.h"
#include "string-extra.h"

/* cache hints on what's more important to keep */
#define SECPRIO_DATA    1
#define SECPRIO_FAT     3
#define SECPRIO_DIRENT  2

/* fake compare-and-swaps for now (to extend cluster chain) */
static inline uint16_t __fat_cas16(uint16_t *addr,
                                   uint16_t cmpval,
                                   uint16_t swpval)
{
    *addr = swpval;
    return cmpval;
}

static inline uint32_t __fat_cas32(uint32_t *addr,
                                   uint32_t cmpval,
                                   uint32_t swpval)
{
    *addr = swpval;
    return cmpval;
}

/* just compiler barriers for now (but type-checked) */
#define __fsinfo_lock_init(_bpb) \
    do { struct bpb *__bpb = (_bpb); (void)__bpb; \
    } while (0)

#define __fsinfo_lock(_bpb) \
    do { struct bpb *__bpb = (_bpb); (void)__bpb; \
         asm volatile("" : : : "memory");         \
    } while (0)

#define __fsinfo_unlock(_bpb) \
    do { struct bpb *__bpb = (_bpb); (void)__bpb; \
         asm volatile("" : : : "memory");         \
    } while (0)

static inline void fsinfo_freecount_dec(struct bpb *bpb,
                                        long nextfree)
{
    __fsinfo_lock(bpb);

    bpb->fsinfo.nextfree = nextfree;
    if (bpb->fsinfo.freecount > 0)
        bpb->fsinfo.freecount--;

    bpb->fsinfo.dirty = true;

    __fsinfo_unlock(bpb);
}

static inline void fsinfo_freecount_inc(struct bpb *bpb)
{
    __fsinfo_lock(bpb);

    bpb->fsinfo.freecount++;
    bpb->fsinfo.dirty = true;

    __fsinfo_unlock(bpb);
}

#define BYTES2INT32(array, pos) \
    (((uint32_t)array[pos+0] <<  0) | \
     ((uint32_t)array[pos+1] <<  8) | \
     ((uint32_t)array[pos+2] << 16) | \
     ((uint32_t)array[pos+3] << 24))

#define INT322BYTES(array, pos, val) \
    ((array[pos+0] = (uint32_t)(val) >>  0), \
     (array[pos+1] = (uint32_t)(val) >>  8), \
     (array[pos+2] = (uint32_t)(val) >> 16), \
     (array[pos+3] = (uint32_t)(val) >> 24))

#define BYTES2INT16(array, pos) \
    (((uint32_t)array[pos+0] << 0) | \
     ((uint32_t)array[pos+1] << 8))

#define INT162BYTES(array, pos, val) \
    ((array[pos+0] = (uint16_t)(val) >> 0), \
     (array[pos+1] = (uint16_t)(val) >> 8))

#define FATTYPE_FAT12       0
#define FATTYPE_FAT16       1
#define FATTYPE_FAT32       2

/* BPB offsets; generic */
#define BS_JMPBOOT          0
#define BS_OEMNAME          3
#define BPB_BYTSPERSEC      11
#define BPB_SECPERCLUS      13
#define BPB_RSVDSECCNT      14
#define BPB_NUMFATS         16
#define BPB_ROOTENTCNT      17
#define BPB_TOTSEC16        19
#define BPB_MEDIA           21
#define BPB_FATSZ16         22
#define BPB_SECPERTRK       24
#define BPB_NUMHEADS        26
#define BPB_HIDDSEC         28
#define BPB_TOTSEC32        32

/* fat12/16 */
#define BS_DRVNUM           36
#define BS_RESERVED1        37
#define BS_BOOTSIG          38
#define BS_VOLID            39
#define BS_VOLLAB           43
#define BS_FILSYSTYPE       54

/* fat32 */
#define BPB_FATSZ32         36
#define BPB_EXTFLAGS        40
#define BPB_FSVER           42
#define BPB_ROOTCLUS        44
#define BPB_FSINFO          48
#define BPB_BKBOOTSEC       50
#define BS_32_DRVNUM        64
#define BS_32_BOOTSIG       66
#define BS_32_VOLID         67
#define BS_32_VOLLAB        71
#define BS_32_FILSYSTYPE    82

#define BPB_LAST_WORD       510

/* used to collect and verify BPB info */
struct fatbpb
{
    /* generic */
    uint16_t bpb_bytspersec;
    uint8_t  bpb_secperclus;
    uint16_t bpb_rsvdseccnt;
    uint8_t  bpb_numfats;
    uint16_t bpb_rootentcnt;
    uint16_t bpb_totsec16;
    uint8_t  bpb_media;
    uint16_t bpb_fatsz16;
    uint32_t bpb_totsec32;

    /* fat12/16 */

    /* fat32 */
    uint32_t bpb_fatsz32;
    uint16_t bpb_extflags;

    /* all */
    uint16_t bpb_lastword;
    bool     bpb_isfat16;
};

/* Short and long name directory entry template */
union raw_dirent
{
    struct /* short entry */
    {
        uint8_t  name[8+3];         /*  0 */
        uint8_t  attr;              /* 11 */
        uint8_t  ntres;             /* 12 */
        uint8_t  crttimetenth;      /* 13 */
        uint16_t crttime;           /* 14 */
        uint16_t crtdate;           /* 16 */
        uint16_t lstaccdate;        /* 18 */
        uint16_t fstclushi;         /* 20 */
        uint16_t wrttime;           /* 22 */
        uint16_t wrtdate;           /* 24 */
        uint16_t fstcluslo;         /* 26 */
        uint32_t filesize;          /* 28 */
                                    /* 32 */
    };
    struct /* long entry */
    {
        uint8_t  ldir_ord;          /*  0 */
        uint8_t  ldir_name1[10];    /*  1 */
        uint8_t  ldir_attr;         /* 11 */
        uint8_t  ldir_type;         /* 12 */
        uint8_t  ldir_chksum;       /* 13 */
        uint8_t  ldir_name2[12];    /* 14 */
        uint16_t ldir_fstcluslo;    /* 26 */
        uint8_t  ldir_name3[4];     /* 28 */
                                    /* 32 */
    };
    struct /* raw byte array */
    {
        uint8_t  data[32];          /*  0 */
                                    /* 32 */
    };
};

/* Number of bytes reserved for a file name (including the trailing \0).
 * Since names are stored in the entry as UTF-8, we won't be ble to
 * store all names allowed by FAT. In FAT, a name can have max 255
 * characters (not bytes!). The worst case UTF-8 conversion is where
 * each two-byte UTF-16 character expands to a 3-byte UTF-8 character,
 * requiring 765 bytes for the final name.
 *
 * U+000000-U+00007F: 2 bytes => 1 byte  (-1 / char)
 * U+000080-U+0007FF: 2 bytes => 2 bytes (+0 / char)
 * U+000800-U+00FFFF: 2 bytes => 3 bytes (+1 / char)
 * U+010000-U+10FFFF: 4 bytes => 4 bytes (+0 / char)
 */
#define FAT_UTF8_NAME_MAX       255 /* our limit */
#define MAX_DIRENTRIES        65536
#define MAX_DIRECTORY_SIZE (MAX_DIRENTRIES*32) /* 2MB max size */
