/***************************************************************************
 *             __________               __   ___.
 *   Open      \______   \ ____   ____ |  | _\_ |__   _______  ___
 *   Source     |       _//  _ \_/ ___\|  |/ /| __ \ /  _ \  \/  /
 *   Jukebox    |    |   (  <_> )  \___|    < | \_\ (  <_> > <  <
 *   Firmware   |____|_  /\____/ \___  >__|_ \|___  /\____/__/\_ \
 *                     \/            \/     \/    \/            \/
 * $Id$
 *
 * Copyright (C) 2005 Miika Pekkarinen
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This software is distributed on an "AS IS" basis, WITHOUT WARRANTY OF ANY
 * KIND, either express or implied.
 *
 ****************************************************************************/
#include "config.h"
#include "system.h"
#include <sound.h>
#include "dsp.h"
#include "dsp-util.h"
#include "eq.h"
#include "compressor.h"
#include "kernel.h"
#include "settings.h"
#include "replaygain.h"
#include "tdspeed.h"
#include "core_alloc.h"
#include "fixedpoint.h"
#include "fracmul.h"

/* Define LOGF_ENABLE to enable logf output in this file */
/*#define LOGF_ENABLE*/
#include "logf.h"

/* 16-bit samples are scaled based on these constants. The shift should be
 * no more than 15.
 */
#define WORD_SHIFT              12
#define WORD_FRACBITS           27

#define NATIVE_DEPTH            16
#define SAMPLE_BUF_COUNT        128 /* Per channel, per DSP */
#define RESAMPLE_BUF_COUNT      192 /* Per channel, per DSP */
/* All told, 5120 bytes for sample/resample bufs (as before) */
#define DEFAULT_GAIN            0x01000000

/* Include header with defines which functions are implemented in assembly
   code for the target */
#include <dsp_asm.h>

/** Common function prototypes **/

/* NOTE: Typedefs keep things much neater and saner here */

/* DSP sample transform function prototype */
typedef void (*dsp_proc_fn_type)(struct dsp_data *data,
                                 struct dsp_buffer **buf);

/* DSP final buffer output function call prototype */
typedef void (*sample_output_fn_type)(int count, struct dsp_data *data,
                                      int32_t const * const src[], int16_t *dst);

/*
 ***************************************************************************/

/* These could in be put in any order
 * Exceptions:
 *  * Sample source conversion, which must be before any other processing
 *  * Anything that depends on the native sample rate must go after the
 *    resampler.
 */
static const struct dsp_stage
{
    uint32_t proc_mask;   /* Id bit flag to use in dsp->proc_mask */
    struct dsp_proc_entry
    {
        uint32_t ip_mask; /* In-place Id bit (0 or Id bit flag if IP) */
        union
        {
            dsp_proc_fn_type fn;   /* Function for stage (static) */
            void (*init_cb)(struct dsp_proc_entry *new); /* Dynamic init */
        };
    } proc_entry;
} dsp_stages[] =
{
    /* Gain stage */
    { .proc_mask  = DSP_PROC_GAIN,
      .proc_entry = { .ip_mask = DSP_PROC_GAIN,
                      { .fn = dsp_apply_gain } } },
#ifdef HAVE_PITCHSCREEN
    /* Timestretch */
    { .proc_mask  = DSP_PROC_TIMESTRETCH,
      .proc_entry = { .ip_mask = 0,
                      { .fn = tdspeed_doit } } },
#endif
    /* Resampler */
    { .proc_mask  = DSP_PROC_RESAMPLE,
      .proc_entry = { .ip_mask = 0,
                      { .fn = resample } } },
    /* Crossfeed */
    { .proc_mask  = DSP_PROC_CROSSFEED,
      .proc_entry = { .ip_mask = DSP_PROC_CROSSFEED,
                      { .fn = apply_crossfeed } } },
    /* Equalizer */
    { .proc_mask  = DSP_PROC_EQUALIZER,
      .proc_entry = { .ip_mask = DSP_PROC_EQUALIZER,
                      { .fn = eq_process } } },
#ifdef HAVE_SW_TONE_CONTROLS
    /* Tone controls */
    { .proc_mask  = DSP_PROC_TONE_CONTROLS,
      .proc_entry = { .ip_mask = DSP_PROC_TONE_CONTROLS,
                      { .fn = tone_process } } },
#endif
    /* Channel config - correct values determined later */
    { .proc_mask  = DSP_PROC_CHANNELS,
      .proc_entry = { .ip_mask = DSP_PROC_MASK_USE_INIT_CB,
                      { .init_cb = channels_process_init_cb } } },
    /* Compressor */
    { .proc_mask  = DSP_PROC_COMPRESSOR,
      .proc_entry = { .ip_mask = DSP_PROC_COMPRESSOR,
                      { .fn = compressor_process } } },
};

struct dsp_config
{
    /** General DSP-local data **/
    struct dsp_data data; /* Config members for use in external routines */
    long codec_frequency; /* Sample rate of data coming from the codec */
    long frequency;       /* Effective sample rate after pitch shift (if any) */
    int  sample_depth;    /* Codec-specified sample depth */
    int  stereo_mode;     /* Codec input format */
#ifdef CPU_COLDFIRE
    unsigned long old_macsr; /* Old macsr value to restore */
#endif
#ifdef HAVE_PITCHSCREEN
    bool processing;      /* DSP is processing (to thwart inopportune buffer
                             moves) */
#endif
#ifdef HAVE_SW_TONE_CONTROLS
    struct eqfilter tone_filter; /* Filter data for software tone controls */
#endif

    /** Sample input from src buffer **/
    dsp_proc_fn_type input_samples; /* Sample input converter (always set) */
    struct dsp_buffer sample_buf; /* Buffer descriptor for converted samples */
    int32_t sample_buf_arr[2][SAMPLE_BUF_COUNT]; /* Actual data */

    /** Resampling backend **/
    struct dsp_buffer resample_buf; /* Buffer descriptor for resampled data */
    int32_t resample_buf_arr[2][RESAMPLE_BUF_COUNT]; /* Actual data */

    /** General dependant processing functions **/
    uint32_t proc_mask;      /* Mask of enabled stages */
    int proc_count;          /* Count of enabled stages */
    struct dsp_proc_entry *proc_entries; /* Array of enabled stages */

    /** Final sample output **/
    sample_output_fn_type output_samples; /* Output function (always set) */
};

/* Allocate separately from dsp_config because not all may be applied to voice */
/* All are possible */
static struct dsp_proc_entry audio_dsp_enabled_entries[8] IBSS_ATTR;
/* resample, tone */
static struct dsp_proc_entry voice_dsp_enabled_entries[2] IBSS_ATTR;

/* General DSP config */
static struct dsp_config dsp_conf[DSP_COUNT] IBSS_ATTR;

/* Dithering */
static struct dither_data
{
    long error[3];  /* 00h */
    long random;    /* 0ch */
                    /* 10h */
} dither_data[2] IBSS_ATTR; /* 0=left, 1=right */

/* Crossfeed */
struct crossfeed_data
{
    int32_t gain;           /* 00h - Direct path gain */
    int32_t coefs[3];       /* 04h - Coefficients for the shelving filter */
    int32_t history[4];     /* 10h - Format is x[n - 1], y[n - 1] for both channels */
    int32_t delay[13][2];   /* 20h */
    int32_t *index;         /* 88h - Current pointer into the delay line */
                            /* 8ch */
} crossfeed_data IDATA_ATTR = /* A */
{
    .index = (int32_t *)crossfeed_data.delay
};

/* Equalizer
 *
 * Current setup is one lowshelf filters three peaking filters and one
 *  highshelf filter. Varying the number of shelving filters make no sense,
 *  but adding peaking filters is possible.
 */
static struct eq_state
{
    char enabled[5];            /* 00h - Flags for active filters */
    struct eqfilter filters[5]; /* 08h - packing is 4? */
                                /* 10ch */
} eq_data;                      /* A */

/* Software tone controls
 * Applied to voice and codec since hardware controls also do so */
#ifdef HAVE_SW_TONE_CONTROLS
static struct tone_control_state
{
    int prescale;                                   /* A/V */
    int bass;                                       /* A/V */
    int treble;                                     /* A/V */
} tone_data;         /* A/V */
#endif /* HAVE_SW_TONE_CONTROLS */

/* Settings applicable to audio codec only */
#ifdef HAVE_PITCHSCREEN
struct timestretch_data
{
    int32_t percent;    /* Speed% * PITCH_SPEED_PRECISION */
    bool enabled;
} timestretch_data;

static int32_t pitch_ratio = PITCH_SPEED_100;
#endif

#define DSP_NUM_CHANNELS_PROC 6
struct channels_mode_data
{
    long sw_gain;   /* 00h: for ...chan_custom */
    long sw_cross;  /* 04h: for ...chan_custom */
    const dsp_proc_fn_type fns[DSP_NUM_CHANNELS_PROC];
    int channels_mode;
} channels_mode_data =
{
    .sw_gain = 0,
    .sw_cross = 0,
    .fns =
    {
        [SOUND_CHAN_STEREO]     = NULL,
        [SOUND_CHAN_MONO]       = channels_process_sound_chan_mono,
        [SOUND_CHAN_CUSTOM]     = channels_process_sound_chan_custom,
        [SOUND_CHAN_MONO_LEFT]  = channels_process_sound_chan_mono_left,
        [SOUND_CHAN_MONO_RIGHT] = channels_process_sound_chan_mono_right,
        [SOUND_CHAN_KARAOKE]    = channels_process_sound_chan_karaoke,
    },
    .channels_mode = SOUND_CHAN_STEREO,
};

static bool dither_enabled;

struct dsp_gain
{
    int32_t eq_precut;               /* EQ precut amp setting */
    struct dsp_replay_gains rpgains; /* Cached replay gain settings */
    int32_t replaygain;              /* Final replay gain value */
} dsp_gain;

static void dsp_update_replaygain(const struct dsp_replay_gains *gains);

