/***************************************************************************
 *             __________               __   ___.
 *   Open      \______   \ ____   ____ |  | _\_ |__   _______  ___
 *   Source     |       _//  _ \_/ ___\|  |/ /| __ \ /  _ \  \/  /
 *   Jukebox    |    |   (  <_> )  \___|    < | \_\ (  <_> > <  <
 *   Firmware   |____|_  /\____/ \___  >__|_ \|___  /\____/__/\_ \
 *                     \/            \/     \/    \/            \/
 * $Id$
 *
 * Copyright (C) 2005 Miika Pekkarinen
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This software is distributed on an "AS IS" basis, WITHOUT WARRANTY OF ANY
 * KIND, either express or implied.
 *
 ****************************************************************************/
#include "config.h"
#include "system.h"
#include <sound.h>
#include "dsp.h"
#include "dsp-util.h"
#include "eq.h"
#include "compressor.h"
#include "kernel.h"
#include "settings.h"
#include "replaygain.h"
#include "tdspeed.h"
#include "core_alloc.h"
#include "fixedpoint.h"
#include "fracmul.h"

/* Define LOGF_ENABLE to enable logf output in this file */
/*#define LOGF_ENABLE*/
#include "logf.h"

/* 16-bit samples are scaled based on these constants. The shift should be
 * no more than 15.
 */
#define WORD_SHIFT              12
#define WORD_FRACBITS           27

#define NATIVE_DEPTH            16
#define SAMPLE_BUF_COUNT        128 /* Per channel */
#define RESAMPLE_BUF_COUNT      128 /* Per channel */
#define DEFAULT_GAIN            0x01000000

/* No asm...yet */
struct dither_data
{
    long error[3];  /* 00h */
    long random;    /* 0ch */
                    /* 10h */
};

struct crossfeed_data
{
    int32_t gain;           /* 00h - Direct path gain */
    int32_t coefs[3];       /* 04h - Coefficients for the shelving filter */
    int32_t history[4];     /* 10h - Format is x[n - 1], y[n - 1] for both channels */
    int32_t delay[13][2];   /* 20h */
    int32_t *index;         /* 88h - Current pointer into the delay line */
                            /* 8ch */
};

/* Current setup is one lowshelf filters three peaking filters and one
 *  highshelf filter. Varying the number of shelving filters make no sense,
 *  but adding peaking filters is possible.
 */
struct eq_state
{
    char enabled[5];            /* 00h - Flags for active filters */
    struct eqfilter filters[5]; /* 08h - packing is 4? */
                                /* 10ch */
};

#ifdef HAVE_SW_TONE_CONTROLS
struct tone_control_state
{
    int prescale;                                   /* A/V */
    int bass;                                       /* A/V */
    int treble;                                     /* A/V */
};
#endif /* HAVE_SOFTWARE_TONE_CONTROLS */

/* Include header with defines which functions are implemented in assembly
   code for the target */
#include <dsp_asm.h>

/** Common function prototypes **/

/* NOTE: Typedefs keep things much neater and saner here */

/* DSP resample engine function call prototype */ 
typedef int (*resample_fn_type)(struct dsp_data *data,
                                struct dsp_buffer *src, struct dsp_buffer *dst);

/* DSP final buffer output function call prototype */
typedef void (*sample_output_fn_type)(int count, struct dsp_data *data,
