/*
 * Copyright (C) 2008-2009 SVOX AG, Baslerstr. 30, 8048 Zuerich, Switzerland
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
/**
 * @file picopam.c
 *
 * Phonetic to Acoustic Mapping PU - Implementation
 *
 * Copyright (C) 2008-2009 SVOX AG, Baslerstr. 30, 8048 Zuerich, Switzerland
 * All rights reserved.
 *
 * History:
 * - 2009-04-20 -- initial version
 *
 */

#include "picodefs.h"
#include "picoos.h"
#include "picodbg.h"
#include "picodata.h"
#include "picopam.h"
#include "picokdt.h"
#include "picokpdf.h"
#include "picoktab.h"
#include "picokdbg.h"
#include "picodsp.h"

#ifdef __cplusplus
extern "C" {
#endif
#if 0
}
#endif

#define PICOPAM_IN_BUFF_SIZE PICODATA_BUFSIZE_PAM    /*input buffer size for PAM */
#define PICOPAM_OUT_PAM_SIZE PICODATA_BUFSIZE_PAM    /*output buffer size for PAM*/
#define PICOPAM_DT_NRLFZ    5    /* nr of lfz decision trees per phoneme */
#define PICOPAM_DT_NRMGC    5    /* nr of mgc decision trees per phoneme */

#define PICOPAM_INVEC_SIZE 60           /*phone feature vector size */
#define PICOPAM_MAX_SYLL_PER_SENT 100   /*maximum number of syllables per sentece*/
#define PICOPAM_MAX_PH_PER_SENT 400     /*maximum number of phonemes  per sentece*/
#define PICOPAM_MAX_ITEM_PER_SENT 255   /*maximum number of attached items per sentence*/
#define PICOPAM_MAX_ITEM_SIZE_PER_SENT 4096 /*maximum size of attached items per sentence*/

#define PICOPAM_READY 20 /*PAM could start backward processing*/
#define PICOPAM_MORE  21 /*PAM has still to collect */
#define PICOPAM_NA    22 /*PAM has not to deal with this item*/
#define PICOPAM_ERR   23 /*input item is not a valid item*/

/*sentence types:cfr pam_map_sentence_type*/
#define PICOPAM_DECLARATIVE   0
#define PICOPAM_INTERROGATIVE 1
#define PICOPAM_EXCLAMATIVE   2

#define PICOPAM_T   0
#define PICOPAM_P   1
#define PICOPAM_p   2
#define PICOPAM_Y   3

#if 1
#define PAM_PHR2_WITH_PR1 1 /*deal with PHR2 boundaries as with PHR1*/
#else
#define PAM_PHR2_WITH_PR3 1 /*deal with PHR2 boundaries as with PHR3*/
#endif

#define PICOPAM_DONT_CARE_VALUE  250 /*don't care value for tree printout    */
#define PICOPAM_DONT_CARE_VAL    10  /*don't care value for tree feeding     */
#define PICOPAM_PH_DONT_CARE_VAL 7   /*don't care value for tree feeding (phonetic)*/

#define PICOPAM_MAX_STATES_PER_PHONE 5 /*number of states per phone    */
#define PICOPAM_STATE_SIZE_IN_ITEM   6 /*size of a state in frame item */
#define PICOPAM_FRAME_ITEM_SIZE      4+PICOPAM_MAX_STATES_PER_PHONE*PICOPAM_STATE_SIZE_IN_ITEM

#define PICOPAM_DIR_FORW 0 /*forward adapter processing*/
#define PICOPAM_DIR_BACK 1 /*backward adapter processing*/
#define PICOPAM_DIR_SIL  2 /*final silence attributes*/

#define PICOPAM_SYLL_PAUSE  0 /*syllable but containing a pause phone*/
#define PICOPAM_SYLL_SYLL   1 /*a real syllable with phonemes*/

#define PICOPAM_EVENT_P_BOUND 0 /*primary boundary*/
#define PICOPAM_EVENT_S_BOUND 1 /*secondary boundary*/
#define PICOPAM_EVENT_W_BOUND 3 /*word boundary*/
#define PICOPAM_EVENT_SYLL    4 /*syllable*/

/* ----- CONSTANTS FOR BREAK COMMAND SUPPORT ----- */
#define PICOPAM_PWIDX_SBEG 0
#define PICOPAM_PWIDX_PHR1 1
#define PICOPAM_PWIDX_PHR2 2
#define PICOPAM_PWIDX_SEND 3
#define PICOPAM_PWIDX_DEFA 4
#define PICOPAM_PWIDX_SIZE 5

/*----------------------------------------------------------------*/
/*structure related to the feature vectors for feeding the trees  */
/*NOTE : the same data structure is used to manage the syllables  */
/*       Using the first 8 fields for marking the boundaries      */
/*       and using the last 4 bytes as follows                    */
/*     byte 61 : 1st attached non PAM item id(0=no item attached) */
/*               in the "sSyllItemOffs" data structure            */
/*     byte 62 : last attached non PAM item id(0=no item attached)*/
/*               in the "sSyllItemOffs" data structure            */
/*     byte 63..64 : offset of the start of the syllable in       */
/*                   the "sPhIds" data structure                  */
typedef struct
{
    picopal_uint8 phoneV[PICOPAM_VECT_SIZE];
} sFtVect, *pSftVect;

/*----------------------------------------------------------
 Name    :   pam_subobj
 Function:   subobject definition for the pam processing
 Shortcut:   pam
 ---------------------------------------------------------*/
typedef struct pam_subobj
{
    /*----------------------PU voice management------------------------------*/
    /* picorsrc_Voice voice; */
    /*----------------------PU state management------------------------------*/
    picoos_uint8 procState; /* where to take up work at next processing step */
    picoos_uint8 retState; /* where to go back from feed state at next p.s. */
    picoos_uint8 needMoreInput; /* more data necessary to start processing   */
    /*----------------------PU input management------------------------------*/
    picoos_uint8 inBuf[PICOPAM_IN_BUFF_SIZE]; /* internal input buffer */
    picoos_uint16 inBufSize; /* actually allocated size */
    picoos_uint16 inReadPos, inWritePos; /* next pos to read/write from/to inBuf*/
    /*----------------------PU output management-----------------------------*/
    picoos_uint8 outBuf[PICOPAM_OUT_PAM_SIZE]; /* internal output buffer */
    picoos_uint16 outBufSize; /* actually allocated size */
    picoos_uint16 outReadPos, outWritePos; /* next pos to read/write from/to outBuf*/
    /*---------------------- adapter working buffers    --------------------*/
    picoos_uint8 *sPhFeats; /*feature vector for a single phone      */
    sFtVect *sSyllFeats; /*Syllable feature vector set for the
     full sentence                          */
    picoos_uint8 *sPhIds; /*phone ids for the full sentence        */
    picoos_uint8 *sSyllItems; /*items attached to the syllable         */
    picoos_int16 *sSyllItemOffs;/*offset of items attached to the syllable*/
    /*---------------------- adapter general variables ---------------------*/
    picoos_int16 nTotalPhonemes; /*number of phonemes in the sentence*/
    picoos_int16 nCurrPhoneme; /*current phoneme in the sentence   */
    picoos_int16 nSyllPhoneme; /*current phoneme in the syllable   */
    picoos_int16 nCurrSyllable; /*current syllable in the sentence  */
    picoos_int16 nTotalSyllables; /*number of syllables in the sentence -> J1*/
    picoos_uint8 nLastAttachedItemId;/*last attached item id*/
    picoos_uint8 nCurrAttachedItem; /*current attached item*/
    picoos_int16 nAttachedItemsSize; /*total size of the attached items*/
    picoos_uint8 sType; /*Sentence type*/
    picoos_uint8 pType; /*Phrase type*/
    picoos_single pMod; /*pitch modifier*/
    picoos_single dMod; /*Duration modifier*/
    picoos_single dRest; /*Duration modifier rest*/
    /*---------------------- adapter specific component variables ----------*/
    picoos_uint8 a3_overall_syllable; /* A3 */
    picoos_uint8 a3_primary_phrase_syllable;
    picoos_uint8 b4_b5_syllable; /* B4,B5 */
    picoos_uint8 b6_b7_syllable; /* B6,B7 */
    picoos_uint8 b6_b7_state;
    picoos_uint8 b8_b9_stressed_syllable; /* B8,B9 */
    picoos_uint8 b10_b11_accented_syllable; /* B10,B11 */
    picoos_uint8 b12_b13_syllable; /* B12,B13 */
    picoos_uint8 b12_b13_state;
    picoos_uint8 b14_b15_syllable; /* B14,B15 */
    picoos_uint8 b14_b15_state;
    picoos_uint8 b17_b19_syllable; /* B17,B19 */
    picoos_uint8 b17_b19_state;
    picoos_uint8 b18_b20_b21_syllable; /* B18,B20,B21 */
    picoos_uint8 b18_b20_b21_state;
    picoos_uint8 c3_overall_syllable; /* C3 */
    picoos_uint8 c3_primary_phrase_syllable;
    picoos_uint8 d2_syllable_in_word; /* D2 */
    picoos_uint8 d2_prev_syllable_in_word;
    picoos_uint8 d2_current_primary_phrase_word;
    picoos_int8 e1_syllable_word_start; /* E1 */
    picoos_int8 e1_syllable_word_end;
    picoos_uint8 e1_content;
    picoos_int8 e2_syllable_word_start; /* E2 */
    picoos_int8 e2_syllable_word_end;
    picoos_uint8 e3_e4_word; /* E3,E4 */
    picoos_uint8 e3_e4_state;
    picoos_uint8 e5_e6_content_word; /* E5,E6 */
    picoos_uint8 e5_e6_content;
    picoos_uint8 e7_e8_word; /* E7,E8 */
    picoos_uint8 e7_e8_content;
    picoos_uint8 e7_e8_state;
    picoos_uint8 e9_e11_word; /* E9,E11 */
    picoos_uint8 e9_e11_saw_word;
    picoos_uint8 e9_e11_state;
    picoos_uint8 e10_e12_e13_word; /* E10,E12,E13 */
    picoos_uint8 e10_e12_e13_state;
    picoos_uint8 e10_e12_e13_saw_word;
    picoos_uint8 f2_overall_word; /* F2 */
    picoos_uint8 f2_word_syllable;
    picoos_uint8 f2_next_word_syllable;
    picoos_uint8 f2_current_primary_phrase_word;
    picoos_int8 g1_current_secondary_phrase_syllable; /*G1 */
    picoos_int8 g1_current_syllable;
    picoos_int8 g2_current_secondary_phrase_word; /*G2 */
    picoos_int8 g2_current_word;
    picoos_uint8 h1_current_secondary_phrase_syll; /*H1 */
    picoos_uint8 h2_current_secondary_phrase_word; /*H2 */
    picoos_uint8 h3_h4_current_secondary_phrase_word; /*H3,H4 */
    picoos_uint8 h5_current_phrase_type; /*H5 */

    picoos_uint8 h5_syllable; /* H5 */
    picoos_uint8 h5_state;

    picoos_uint8 i1_secondary_phrase_syllable; /*I1 */
    picoos_uint8 i1_next_secondary_phrase_syllable;
    picoos_uint8 i2_secondary_phrase_word; /*I2 */
    picoos_uint8 i2_next_secondary_phrase_word;
    picoos_uint8 j1_utterance_syllable; /*J1 */
    picoos_uint8 j2_utterance_word; /*J2 */
