/***************************************************************************
 *             __________               __   ___.
 *   Open      \______   \ ____   ____ |  | _\_ |__   _______  ___
 *   Source     |       _//  _ \_/ ___\|  |/ /| __ \ /  _ \  \/  /
 *   Jukebox    |    |   (  <_> )  \___|    < | \_\ (  <_> > <  <
 *   Firmware   |____|_  /\____/ \___  >__|_ \|___  /\____/__/\_ \
 *                     \/            \/     \/    \/            \/
 * $Id$
 *
 * Copyright (C) 2007 Jens Arnold
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This software is distributed on an "AS IS" basis, WITHOUT WARRANTY OF ANY
 * KIND, either express or implied.
 *
 ****************************************************************************/
#include "plugin.h"
#include "lib/configfile.h"



/************ Start of MAS pcm codec, raw i2c blocks ************/

// address 04640  count 30 (126 bytes)
static const unsigned char maspcm_array1[] = {
    0xe0, 0x00, 0x00, 0x1e, 0x06, 0x40,
    0x00, 0x08, 0x00, 0x00, // 00080000
    0x00, 0x00, 0x00, 0x00, // 00000000
    0x00, 0x00, 0x00, 0x00, // 00000000
    0x00, 0x08, 0x00, 0x00, // 00080000
    0x00, 0x00, 0x00, 0x25, // 00000025
    0x00, 0x00, 0x00, 0x04, // 00000004
    0x00, 0x00, 0x48, 0x00, // 00004800

    0x00, 0x06, 0x9C, 0x6E, // 00069C6E
    0x00, 0x06, 0x9C, 0x63, // 00069C63
    0x00, 0x06, 0xAC, 0x7D, // 0006AC7D
    0x00, 0x00, 0x00, 0x00, // 00000000
    0x00, 0x06, 0x04, 0x73, // 00060473
    0x00, 0x07, 0x5C, 0x01, // 00075C01
    0x00, 0x07, 0x1E, 0x00, // 00071E00
    0x00, 0x08, 0x80, 0x41, // 00088041
    0x00, 0x02, 0x9E, 0x10, // 00029E10
    0x00, 0x02, 0x1B, 0x7F, // 00021B7F
    0x00, 0x02, 0x81, 0x28, // 00028128
    0x00, 0x0B, 0x40, 0x7F, // 000B407F
    0x00, 0x08, 0x12, 0x42, // 00081242
    0x00, 0x09, 0x1B, 0xC2, // 00091BC2
    0x00, 0x02, 0x87, 0x08, // 00028708
    0x00, 0x08, 0x92, 0xC3, // 000892C3
    0x00, 0x06, 0x84, 0x73, // 00068473
    0x00, 0x07, 0x64, 0x00, // 00076400
    0x00, 0x07, 0x27, 0x00, // 00072700
    0x00, 0x07, 0x7C, 0x00, // 00077C00
    0x00, 0x07, 0x3C, 0x00, // 00073C00
    0x00, 0x0B, 0x5B, 0x40, // 000B5B40
    0x00, 0x0B, 0x6D, 0x7F, // 000B6D7F
    0x00, 0x06, 0xA4, 0x05, // 0006A405
    0x00, 0x01, 0x41, 0x80, // 00014180
    0x00, 0x06, 0xB8, 0x22, // 0006B822
    0x00, 0x07, 0x98, 0x0F, // 0007980F
    0x00, 0x00, 0x00, 0x00, // 00000000
    0x00, 0x07, 0x98, 0x0F, // 0007980F
    0x00, 0x00, 0xC1, 0x87, // 0000C187
    0x00, 0x06, 0x90, 0x1C, // 0006901C
    0x00, 0x06, 0x9C, 0x62, // 00069C62
    0x00, 0x00, 0x00, 0x00, // 00000000
    0x00, 0x06, 0x9C, 0x63, // 00069C63
    0x00, 0x06, 0x9C, 0x6E, // 00069C6E
    0x00, 0x06, 0xAC, 0x7D, // 0006AC7D
    0x00, 0x00, 0xC1, 0x07, // 0000C107
    0x00, 0x0B, 0x40, 0x40, // 000B4040
    0x00, 0x00, 0x00, 0x00, // 00000000
    0x00, 0x00, 0x00, 0x00, // 00000000
    0x00, 0x00, 0x00, 0x00, // 00000000
    0x00, 0x06, 0x84, 0x62, // 00068462
    0x00, 0x06, 0x84, 0x63, // 00068463
    0x00, 0x06, 0x04, 0x62, // 00060462
    0x00, 0x06, 0x1C, 0x63, // 00061C63
    0x00, 0x0A, 0x0F, 0x41, // 000A0F41
    0x00, 0x08, 0x97, 0xC0, // 000897C0
    0x00, 0x08, 0x1B, 0xC2, // 00081BC2
    0x00, 0x0A, 0x12, 0x47, // 000A1247
    0x00, 0x07, 0x65, 0x00, // 00076500
    0x00, 0x07, 0x24, 0x00, // 00072400
    0x00, 0x07, 0x6D, 0x00, // 00076D00
    0x00, 0x07, 0x2C, 0x00, // 00072C00
    0x00, 0x07, 0x75, 0x00, // 00077500
    0x00, 0x07, 0x34, 0x00, // 00073400
    0x00, 0x0C, 0x12, 0x25, // 000C1225
    0x00, 0x0E, 0x11, 0x24, // 000E1124
    0x00, 0x0E, 0x13, 0x26, // 000E1326
    0x00, 0x00, 0x00, 0x00, // 00000000
    0x00, 0x00, 0x00, 0x00, // 00000000
    0x00, 0x06, 0x04, 0x6C, // 0006046C
    0x00, 0x00, 0xC1, 0x07, // 0000C107
    0x00, 0x09, 0x12, 0xC0, // 000912C0
    0x00, 0x06, 0xBC, 0x62, // 0006BC62
    0x00, 0x06, 0x9C, 0x63, // 00069C63
    0x00, 0x00, 0x00, 0x00, // 00000000
    0x00, 0x06, 0x94, 0x6C, // 0006946C
    0x00, 0x06, 0x94, 0x0F, // 0006940F
    0x00, 0x03, 0x33, 0x33, // 00033333
    0x00, 0x00, 0x00, 0x00, // 00000000
    0x00, 0x00, 0x00, 0x00, // 00000000
    0x00, 0x00, 0x00, 0x00, // 00000000
    0x00, 0x00, 0x00, 0x00, // 00000000
    0x00, 0x00, 0x00, 0x00, // 00000000
    0x00, 0x00, 0x00, 0x00, // 00000000
};

struct i2c_block {
    const unsigned char *data;
    unsigned len;
};

static struct i2c_block maspcm[] = {
    { maspcm_array1,  sizeof(maspcm_array1) },
    { maspcm_array2,  sizeof(maspcm_array2) },
    { maspcm_array3,  sizeof(maspcm_array3) },
    { maspcm_array4,  sizeof(maspcm_array4) },
    { maspcm_array5,  sizeof(maspcm_array5) },
    { maspcm_array6,  sizeof(maspcm_array6) },
    { maspcm_array7,  sizeof(maspcm_array7) },
    { maspcm_array8,  sizeof(maspcm_array8) },
    { maspcm_array9,  sizeof(maspcm_array9) },
    { maspcm_array10, sizeof(maspcm_array10) },
};

/************ End of MAS pcm codec ************/

#define WAVRECORD_QUIT BUTTON_OFF

#define CFGFILE_VERSION 0     /* Current config file version */
#define CFGFILE_MINVERSION 0  /* Minimum config file version to accept */

#define PCM_MAIN_IO_CONTROL      0x0661
#define PCM_IF_STATUS_CONTROL    0x0662
#define PCM_OFREQ_CONTROL        0x0663
#define PCM_OUTPUT_CLOCK_CONF    0x0664
#define PCM_FRAME_COUNTER        0x0665
#define PCM_APP_RUNNING          0x0666
#define PCM_SAMPLE_RATE_STATUS   0x0667
#define PCM_BUFFER_ERROR_COUNTER 0x0668
#define PCM_SOFT_MUTE            0x0669
#define PCM_SPDIF_CHANNEL_STATUS 0x066a
#define PCM_SAMPLE_RATE          0x066b
#define PCM_VOL_OUT_LL           0x066c
#define PCM_VOL_OUT_RL           0x066d
#define PCM_VOL_OUT_LR           0x066e
#define PCM_VOL_OUT_RR           0x066f
#define PCM_VOL_IN_LL            0x0670
#define PCM_VOL_IN_RL            0x0671
#define PCM_VOL_IN_LR            0x0672
#define PCM_VOL_IN_RR            0x0673

#define IRQ3 (*((volatile unsigned long*)0x0900010C))

#define LOW_WATER_CHUNKSIZE (256*1024)

/* declarations */

struct riff_header
{
    uint8_t  riff_id[4];      /* 00h - "RIFF"                            */
    uint32_t riff_size;       /* 04h - sz following headers + data_size  */
    /* format header */
    uint8_t  format[4];       /* 08h - "WAVE"                            */
    uint8_t  format_id[4];    /* 0Ch - "fmt "                            */
    uint32_t format_size;     /* 10h - 16 for PCM (sz format data)       */
    /* format data */
    uint16_t audio_format;    /* 14h - 1=PCM                             */
    uint16_t num_channels;    /* 16h - 1=M, 2=S, etc.                    */
    uint32_t sample_rate;     /* 18h - HZ                                */
    uint32_t byte_rate;       /* 1Ch - num_channels*sample_rate*bits_per_sample/8 */
    uint16_t block_align;     /* 20h - num_channels*bits_per_samples/8   */
    uint16_t bits_per_sample; /* 22h - 8=8 bits, 16=16 bits, etc.        */
    /* Not for audio_format=1 (PCM) */
/*  unsigned short extra_param_size;   24h - size of extra data          */ 
/*  unsigned char  *extra_params; */
    /* data header */
    uint8_t  data_id[4];      /* 24h - "data" */
    uint32_t data_size;       /* 28h - num_samples*num_channels*bits_per_sample/8 */
/*  unsigned char  *data;              2ch - actual sound data */
} __attribute__((packed));

#define RIFF_FMT_HEADER_SIZE       12 /* format -> format_size */
#define RIFF_FMT_DATA_SIZE         16 /* audio_format -> bits_per_sample */
#define RIFF_DATA_HEADER_SIZE       8 /* data_id -> data_size */

#define PCM_DEPTH_BYTES             2
#define PCM_DEPTH_BITS             16

/* Define our own source constants since REC_SRC_FMRADIO will intrude on the count */
enum {   
  WAV_SRC_LINE = 0,   
  WAV_SRC_MIC,   
#ifdef HAVE_SPDIF_REC
  WAV_SRC_SPDIF,   
#endif   
  WAV_NUM_SRC,   
}; 

void rec_tick(void) __attribute__((interrupt_handler));

/* settings */
struct rec_config {
    int samplerate;     /* index */
    int channels;
    int source;
};

struct rec_config reccfg_disk = { 7, 1, 0 };
struct rec_config reccfg;       /* running config */

static const char cfg_filename[] =  "wavrecord.cfg";
